pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
/**
 * @file ui_task.cpp
 * @brief UI Task Implementation for MIPI DSI Display with LVGL
 * 
 * This implementation provides full LVGL integration with MIPI DSI display
 * using the Waveshare 5-DSI-TOUCH-A display and HX8394 driver.
 */

#include "pages/sample_load_save.h"
#include "pages/diagnostics_page.h"
#include "ui_task.h"
#include "pcnt_task.h"
#include "esp_log.h"
#include "esp_check.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "freertos/portable.h"
#include "freertos/event_groups.h"
#include "driver/gpio.h"
#include <stdlib.h>
#include "driver/i2c_master.h"
#include "config/pin_config.h"
#include "config/hardware_config.h"
#include "pages/diagnostics_page.h"
#include "inter_mcu.h"
#include "comm/statistics.h"
#include "links/esp_spi_link.h"
 
// LVGL includes
#include "esp_lvgl_port.h"
#include "lvgl.h"

// Forward declaration for LVGL log callback (defined later in this file)
extern "C" void wavex_lvgl_log_cb(signed char level, const char * buf);
#include "esp_lcd_touch.h"
#include "esp_lcd_touch_gt911.h"
#include "esp_heap_caps.h"
#include "esp_timer.h"
#include "ui/input_dispatcher.h"
#include "ui/ui_demo.h"
#include "ui/ui_navigation_integration.h"
#include "ui/ui_globals.h"

// Workaround for ESP LCD I2C function conflict
// Use the v2 version directly since we have i2c_master_bus_handle_t
#undef esp_lcd_new_panel_io_i2c
#define esp_lcd_new_panel_io_i2c esp_lcd_new_panel_io_i2c_v2

// LVGL port lock macros for thread safety
#define LV_LOCK()   lvgl_port_lock(portMAX_DELAY)
#define LV_UNLOCK() lvgl_port_unlock()

// Include BSP header for display functions
#include "bsp/esp32_p4_nano.h"
#include "ui/tca8418_keypad.h"
 
#define LV_TICK_PERIOD_MS 5
 
 static const char *TAG = "UI_TASK";
 
 // Task handle
 static TaskHandle_t s_ui_task_handle = NULL;
 
// Display and LVGL handles
static esp_lcd_panel_handle_t s_panel_handle = NULL;
static esp_lcd_touch_handle_t s_touch_handle = NULL;
static lv_display_t *s_lvgl_display = NULL;
static esp_timer_handle_t s_lvgl_tick_timer_handle = NULL;
static esp_timer_handle_t s_meter_timer_handle = NULL;
// LVGL timer to apply deferred meter updates in LVGL context
static lv_timer_t *s_meter_lvgl_timer = NULL;
// LVGL timer for applying meter updates (runs in LVGL context with lock held)
static lv_timer_t *s_meter_lv_timer = NULL;
 
// I2C handles
static i2c_master_bus_handle_t s_i2c_bus_handle = NULL;

// UI element references for real-time updates
static lv_obj_t *s_content_area = NULL;

// Hotkey region elements
static lv_obj_t *s_hotkey_region = NULL;
static lv_obj_t *s_hotkey_buttons[6] = {NULL, NULL, NULL, NULL, NULL, NULL};
static lv_obj_t *s_hotkey_labels[6] = {NULL, NULL, NULL, NULL, NULL, NULL};

// Header elements
static lv_obj_t *s_header_title = NULL;

// Current screen context for hotkey mapping
static const char* s_current_screen = "main";

// Sample Load/Save page instance (global for access from other modules)
wavex_sample_load_save_page_t* s_sample_load_save_page = NULL;

// Meter callback system
static wavex_meter_cb_t s_meter_callback = NULL;
static void* s_meter_user_data = NULL;

// Meter data variables
static float s_current_rms = 0.0f;
static float s_current_peak = 0.0f;
static lv_obj_t *s_meter_bar = NULL;
static lv_obj_t *s_meter_label = NULL;

// Enhanced meter display variables
static lv_obj_t *s_meter_bar_l = NULL;
static lv_obj_t *s_meter_bar_r = NULL;
static lv_obj_t *s_peak_line_l = NULL;
static lv_obj_t *s_peak_line_r = NULL;
static lv_obj_t *s_meter_label_l = NULL;
static lv_obj_t *s_meter_label_r = NULL;

// Peak hold tracking
struct PeakHoldData {
    float peak_value;
    uint32_t peak_time_ms;
    bool is_holding;
};
static PeakHoldData s_peak_hold_l = {0.0f, 0, false};
static PeakHoldData s_peak_hold_r = {0.0f, 0, false};
static const uint32_t PEAK_HOLD_TIMEOUT_MS = 500;  // Configurable peak hold duration

// Adaptive refresh rate control
static bool s_content_changed = false;
static uint32_t s_last_refresh_time = 0;
static uint32_t s_refresh_count = 0;
static const uint32_t MIN_REFRESH_INTERVAL_MS = 16;  // 60 FPS maximum
static const uint32_t MAX_REFRESH_INTERVAL_MS = 100; // 10 FPS minimum

// Deferred meter update data (shared between timer and UI task)
static volatile bool s_meter_update_pending = false;
static volatile bool s_meter_reset_pending = false;
static volatile float s_deferred_rms_left = 0.0f;
static volatile float s_deferred_rms_right = 0.0f;
static volatile float s_deferred_peak_left = 0.0f;
static volatile float s_deferred_peak_right = 0.0f;
 
// Forward declarations
static void ui_task(void *pvParameters);
static void lvgl_flush_cb(lv_display_t *disp, const lv_area_t *area, uint8_t *px_map);
static void lvgl_tick_cb(void *arg);
static void meter_update_cb(void *arg);
static void lvgl_meter_apply_cb(lv_timer_t *timer);
static void lv_meter_update_timer_cb(lv_timer_t *timer);
static void meter_data_cb(float rms, float peak, void* user_data);
static esp_err_t init_touch_controller(void);
static void adaptive_refresh_control(void);
void wavex_ui_mark_content_changed(void);

// Enhanced meter functions
static void update_peak_hold(PeakHoldData* peak_data, float current_peak, uint32_t current_time_ms);
static void update_peak_line_position(lv_obj_t* peak_line, lv_obj_t* meter_bar, float peak_value);
void wavex_ui_create_meter_display(lv_obj_t* parent);
static esp_err_t init_lvgl_display(void);

// Menu system functions
static void create_main_menu(lv_obj_t *parent);
static void create_sample_menu(lv_obj_t *parent);
static void create_system_menu(lv_obj_t *parent);
static void create_sample_load_save_page(lv_obj_t *parent);
static void menu_button_event_cb(lv_event_t *e);
static void hotkey_button_event_cb(lv_event_t *e);
static void touch_event_cb(lv_event_t *e);

// Hotkey region functions
static void create_hotkey_region(lv_obj_t *parent);
void wavex_ui_update_hotkey_labels(const char* labels[6]);
static void clear_hotkey_labels(void);
static void calculate_hotkey_layout(int num_items, int* button_widths);
void wavex_ui_set_screen_context(const char* screen_name);
void wavex_ui_update_header_title(const char* title);
 
/**
 * @brief Initialize touch controller with custom configuration
 */
static esp_err_t init_touch_controller(void)
{
    ESP_LOGI(TAG, "Initializing GT911 touch controller with custom config...");

