pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
    // Use BSP's I2C handle to avoid conflicts
    i2c_master_bus_handle_t i2c_handle = bsp_i2c_get_handle();
    if (i2c_handle == NULL) {
        ESP_LOGE(TAG, "BSP I2C not initialized, initializing it first");
        ESP_RETURN_ON_ERROR(bsp_i2c_init(), TAG, "Failed to initialize BSP I2C");
        i2c_handle = bsp_i2c_get_handle();
    }

    // Configure touch reset and interrupt pins for GT911 address selection
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << WAVEX_ESP_TOUCH_RST) | (1ULL << WAVEX_ESP_TOUCH_INT),  // RST and INT pins
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    ESP_RETURN_ON_ERROR(gpio_config(&io_conf), TAG, "Failed to configure touch GPIO pins");

    // --- GT911 Reset and Address Selection Sequence ---
    // Per datasheet, this selects the I2C address. We will select 0x5D.
    gpio_set_level((gpio_num_t)WAVEX_ESP_TOUCH_INT, 1);  // INT high for address 0x5D
    gpio_set_level((gpio_num_t)WAVEX_ESP_TOUCH_RST, 0);  // RST low
    vTaskDelay(pdMS_TO_TICKS(10));
    gpio_set_level((gpio_num_t)WAVEX_ESP_TOUCH_RST, 1);  // RST high
    vTaskDelay(pdMS_TO_TICKS(60)); // Hold INT state for >50ms after reset

    // Release INT pin to be an input for interrupts
    io_conf.pin_bit_mask = (1ULL << WAVEX_ESP_TOUCH_INT);  // Only INT pin
    io_conf.mode = GPIO_MODE_INPUT;
    io_conf.pull_up_en = GPIO_PULLUP_ENABLE; // INT line usually requires a pull-up
    ESP_RETURN_ON_ERROR(gpio_config(&io_conf), TAG, "Failed to reconfigure INT pin to input");

    vTaskDelay(pdMS_TO_TICKS(10)); // Settle time
    // --- End of GT911 Sequence ---

    // Create I2C panel IO for touch controller using BSP's I2C handle
    esp_lcd_panel_io_i2c_config_t io_config = {
        .dev_addr = ESP_LCD_TOUCH_IO_I2C_GT911_ADDRESS, // Use 0x5D address
        .control_phase_bytes = 1,
        .dc_bit_offset = 0,
        .lcd_cmd_bits = 8,
        .lcd_param_bits = 8,
        .flags = {
            .dc_low_on_data = 0,
            .disable_control_phase = 0,
        },
        .scl_speed_hz = 400000,  // 400kHz for GT911
    };

    esp_lcd_panel_io_handle_t io_handle = NULL;
    ESP_RETURN_ON_ERROR(esp_lcd_new_panel_io_i2c(i2c_handle, &io_config, &io_handle),
                       TAG, "Failed to create I2C panel IO");

    // Configure GT911 touch controller with correct orientation for 720x1280 display
    esp_lcd_touch_config_t touch_config = {
        .x_max = BSP_LCD_H_RES,
        .y_max = BSP_LCD_V_RES,
        .rst_gpio_num = (gpio_num_t)WAVEX_ESP_TOUCH_RST,  // Touch reset pin
        .int_gpio_num = (gpio_num_t)WAVEX_ESP_TOUCH_INT,  // Touch interrupt pin
        .levels = {
            .reset = 0,
            .interrupt = 0,
        },
        .flags = {
            .swap_xy = 0,     // No swap for portrait orientation
            .mirror_x = 0,    // No mirror X
            .mirror_y = 0,    // No mirror Y
        },
    };

    ESP_RETURN_ON_ERROR(esp_lcd_touch_new_i2c_gt911(io_handle, &touch_config, &s_touch_handle),
                       TAG, "Failed to create GT911 touch controller");

    ESP_LOGI(TAG, "GT911 touch controller initialized successfully");
    return ESP_OK;
}

static void lvgl_flush_cb(lv_display_t *disp, const lv_area_t *area, uint8_t *px_map)
{
    esp_lcd_panel_handle_t panel_handle = (esp_lcd_panel_handle_t) lv_display_get_user_data(disp);
    // LVGL handles rotation internally, coordinates are already transformed
    // For 90° clockwise rotation: area coordinates should be correct as provided
    esp_lcd_panel_draw_bitmap(panel_handle, area->x1, area->y1, area->x2 + 1, area->y2 + 1, px_map);
    lv_display_flush_ready(disp);
}
 
static void lvgl_tick_cb(void *arg)
{
    lv_tick_inc(LV_TICK_PERIOD_MS);
}

/**
 * @brief Update peak hold tracking for a channel
 */
static void update_peak_hold(PeakHoldData* peak_data, float current_peak, uint32_t current_time_ms)
{
    if (current_peak > peak_data->peak_value) {
        // New peak detected - start holding
        peak_data->peak_value = current_peak;
        peak_data->peak_time_ms = current_time_ms;
        peak_data->is_holding = true;
    } else if (peak_data->is_holding && 
               (current_time_ms - peak_data->peak_time_ms) >= PEAK_HOLD_TIMEOUT_MS) {
        // Peak hold timeout expired - revert to current peak
        peak_data->peak_value = current_peak;
        peak_data->is_holding = false;
    }
}

/**
 * @brief Update peak line position on meter bar
 */
static void update_peak_line_position(lv_obj_t* peak_line, lv_obj_t* meter_bar, float peak_value)
{
    if (!peak_line || !meter_bar || !lv_obj_is_valid(peak_line) || !lv_obj_is_valid(meter_bar)) {
        return;
    }
    
    // Get meter bar dimensions (peak line is now a child of meter bar)
    lv_coord_t bar_width = lv_obj_get_width(meter_bar);
    lv_coord_t bar_height = lv_obj_get_height(meter_bar);
    
    // Calculate peak position (0-100% of bar width)
    int peak_percent = (int)(peak_value * 100.0f);
    if (peak_percent > 100) peak_percent = 100;
    if (peak_percent < 0) peak_percent = 0;
    
    // Position peak line within the meter bar (relative to bar)
    lv_coord_t peak_x = (bar_width * peak_percent) / 100;
    lv_obj_set_pos(peak_line, peak_x, 0);
    lv_obj_set_size(peak_line, 2, bar_height);  // 2px wide vertical line
    
    // Show/hide peak line based on peak value
    if (peak_value > 0.01f) {  // Show if peak > 1%
        lv_obj_clear_flag(peak_line, LV_OBJ_FLAG_HIDDEN);
    } else {
        lv_obj_add_flag(peak_line, LV_OBJ_FLAG_HIDDEN);
    }
}

/**
 * @brief Meter update timer callback for real-time updates
 */
static void meter_update_cb(void *arg)
{
    // Get current meter data from statistics
    wavex_meter_data_t meter_data;
    inter_mcu_get_meter_data(&meter_data);
    // Instrumentation: log received meter snapshot for debugging UI updates
    // ESP_LOGI(TAG, "METER_CB: valid=%d last_update_ms=%u rms_l=%.3f rms_r=%.3f peak_l=%.3f peak_r=%.3f",
    //          meter_data.valid ? 1 : 0,
    //          meter_data.last_update_ms,
    //          meter_data.rms_left, meter_data.rms_right,
    //          meter_data.peak_left, meter_data.peak_right);
    
