pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
    uint32_t current_time_ms = (uint32_t)(esp_timer_get_time() / 1000);
    bool should_reset_meters = false;
    
    // Check for communication timeout (500ms)
    if (meter_data.valid) {
        uint32_t time_since_update = current_time_ms - meter_data.last_update_ms;
        if (time_since_update > 500) {
            should_reset_meters = true;
        }
    } else {
        // No valid data received, reset meters (normal when no audio is running)
        should_reset_meters = true;
    }
    
    if (should_reset_meters) {
        // Only reset if we haven't already reset recently (avoid continuous updates)
        static uint32_t last_reset_time = 0;
        uint32_t time_since_reset = current_time_ms - last_reset_time;
        
        if (time_since_reset > 1000) { // Only reset once per second
            // Reset peak hold values to 0
            s_peak_hold_l.peak_value = 0.0f;
            s_peak_hold_l.peak_time_ms = current_time_ms;
            s_peak_hold_l.is_holding = false;
            
            s_peak_hold_r.peak_value = 0.0f;
            s_peak_hold_r.peak_time_ms = current_time_ms;
            s_peak_hold_r.is_holding = false;
            
            last_reset_time = current_time_ms;
            
            // ESP_LOGI(TAG, "METER_CB: resetting meters (time_since_reset=%u)", (unsigned)time_since_reset);
            // Mark meter reset as pending (will be processed by main UI task)
            s_meter_reset_pending = true;
            wavex_ui_mark_content_changed();
        }
    } else if (meter_data.valid) {
        // Normal operation - update meters with valid data
        // Update peak hold tracking
        update_peak_hold(&s_peak_hold_l, meter_data.peak_left, current_time_ms);
        update_peak_hold(&s_peak_hold_r, meter_data.peak_right, current_time_ms);
        
        // Store meter data for deferred update (no LVGL locks in timer callback)
        s_deferred_rms_left = meter_data.rms_left;
        s_deferred_rms_right = meter_data.rms_right;
        s_deferred_peak_left = s_peak_hold_l.peak_value;
        s_deferred_peak_right = s_peak_hold_r.peak_value;
        
        // ESP_LOGI(TAG, "METER_CB: scheduling meter update rms_l=%.3f rms_r=%.3f peak_l=%.3f peak_r=%.3f",
        //          s_deferred_rms_left, s_deferred_rms_right, s_deferred_peak_left, s_deferred_peak_right);
        // Mark meter update as pending (will be processed by main UI task)
        s_meter_update_pending = true;
        wavex_ui_mark_content_changed();
    }
}

/**
 * @brief Process deferred meter updates (called from main UI task)
 */
static void process_deferred_meter_updates(void)
{
    //ESP_LOGI(TAG, "METER_PROC: entered (pending=%d reset=%d)", s_meter_update_pending ? 1 : 0, s_meter_reset_pending ? 1 : 0);
    if (s_meter_reset_pending) {
        LV_LOCK();
        
        // Reset enhanced meter display if available
        if (s_meter_bar_l && s_meter_bar_r && s_peak_line_l && s_peak_line_r &&
            lv_obj_is_valid(s_meter_bar_l) && lv_obj_is_valid(s_meter_bar_r) &&
            lv_obj_is_valid(s_peak_line_l) && lv_obj_is_valid(s_peak_line_r)) {
            
            // Reset RMS bars to 0
            lv_bar_set_value(s_meter_bar_l, 0, LV_ANIM_ON);
            lv_bar_set_value(s_meter_bar_r, 0, LV_ANIM_ON);
            
            // Hide peak lines (they will be hidden by update_peak_line_position with 0 value)
            update_peak_line_position(s_peak_line_l, s_meter_bar_l, 0.0f);
            update_peak_line_position(s_peak_line_r, s_meter_bar_r, 0.0f);
            
            // Update channel labels to show 0 values
            if (s_meter_label_l && lv_obj_is_valid(s_meter_label_l)) {
                lv_label_set_text(s_meter_label_l, "L: 0.000\nPeak: 0.000");
            }
            
            if (s_meter_label_r && lv_obj_is_valid(s_meter_label_r)) {
                lv_label_set_text(s_meter_label_r, "R: 0.000\nPeak: 0.000");
            }
        }
        
        // Reset fallback legacy single meter display
        else if (s_meter_bar && s_meter_label && 
                 lv_obj_is_valid(s_meter_bar) && lv_obj_is_valid(s_meter_label)) {
            lv_bar_set_value(s_meter_bar, 0, LV_ANIM_ON);
            lv_label_set_text(s_meter_label, "L: 0.000 R: 0.000\nPeak L: 0.000 R: 0.000");
        }
        
        LV_UNLOCK();
        ESP_LOGI(TAG, "METER_PROC: performed meter reset");
        s_meter_reset_pending = false;
    }
    
    if (s_meter_update_pending) {
        LV_LOCK();
        ESP_LOGI(TAG, "METER_PROC: processing deferred meter update pending=%d", s_meter_update_pending ? 1 : 0);
        // Log LVGL object validity to diagnose lifecycle issues
        ESP_LOGI(TAG, "METER_PROC: objs s_meter_bar_l=%p s_meter_bar_r=%p s_peak_line_l=%p s_peak_line_r=%p s_meter_label_l=%p s_meter_label_r=%p",
                 (void*)s_meter_bar_l, (void*)s_meter_bar_r, (void*)s_peak_line_l, (void*)s_peak_line_r,
                 (void*)s_meter_label_l, (void*)s_meter_label_r);
        if (s_meter_bar_l) ESP_LOGI(TAG, "METER_PROC: s_meter_bar_l valid=%d", lv_obj_is_valid(s_meter_bar_l));
        if (s_meter_bar_r) ESP_LOGI(TAG, "METER_PROC: s_meter_bar_r valid=%d", lv_obj_is_valid(s_meter_bar_r));
        if (s_peak_line_l) ESP_LOGI(TAG, "METER_PROC: s_peak_line_l valid=%d", lv_obj_is_valid(s_peak_line_l));
        if (s_peak_line_r) ESP_LOGI(TAG, "METER_PROC: s_peak_line_r valid=%d", lv_obj_is_valid(s_peak_line_r));
        if (s_meter_label_l) ESP_LOGI(TAG, "METER_PROC: s_meter_label_l valid=%d", lv_obj_is_valid(s_meter_label_l));
        if (s_meter_label_r) ESP_LOGI(TAG, "METER_PROC: s_meter_label_r valid=%d", lv_obj_is_valid(s_meter_label_r));
        
        // Update enhanced meter display if available
        if (s_meter_bar_l && s_meter_bar_r && s_peak_line_l && s_peak_line_r &&
            lv_obj_is_valid(s_meter_bar_l) && lv_obj_is_valid(s_meter_bar_r) &&
            lv_obj_is_valid(s_peak_line_l) && lv_obj_is_valid(s_peak_line_r)) {
            
            // Update left channel RMS bar
            int rms_l_value = (int)(s_deferred_rms_left * 100.0f);
            if (rms_l_value > 100) rms_l_value = 100;
            if (rms_l_value < 0) rms_l_value = 0;
            lv_bar_set_value(s_meter_bar_l, rms_l_value, LV_ANIM_ON);
            
            // Update right channel RMS bar
            int rms_r_value = (int)(s_deferred_rms_right * 100.0f);
            if (rms_r_value > 100) rms_r_value = 100;
            if (rms_r_value < 0) rms_r_value = 0;
            lv_bar_set_value(s_meter_bar_r, rms_r_value, LV_ANIM_ON);
            
