pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
            // Update peak line positions
            update_peak_line_position(s_peak_line_l, s_meter_bar_l, s_deferred_peak_left);
            update_peak_line_position(s_peak_line_r, s_meter_bar_r, s_deferred_peak_right);
            
            // Update channel labels
            if (s_meter_label_l && lv_obj_is_valid(s_meter_label_l)) {
                char label_text[32];
                snprintf(label_text, sizeof(label_text), "L: %.3f\nPeak: %.3f", 
                        s_deferred_rms_left, s_deferred_peak_left);
                lv_label_set_text(s_meter_label_l, label_text);
            }
            
            if (s_meter_label_r && lv_obj_is_valid(s_meter_label_r)) {
                char label_text[32];
                snprintf(label_text, sizeof(label_text), "R: %.3f\nPeak: %.3f", 
                        s_deferred_rms_right, s_deferred_peak_right);
                lv_label_set_text(s_meter_label_r, label_text);
            }
        }
        
        // Fallback to legacy single meter display
        else if (s_meter_bar && s_meter_label && 
                 lv_obj_is_valid(s_meter_bar) && lv_obj_is_valid(s_meter_label)) {
            // Use RMS left channel for the bar (assuming stereo)
            float rms_value = s_deferred_rms_left;
            int bar_value = (int)(rms_value * 100.0f);
            if (bar_value > 100) bar_value = 100;
            if (bar_value < 0) bar_value = 0;
            
            lv_bar_set_value(s_meter_bar, bar_value, LV_ANIM_ON);
            
            // Update label with current values
            char meter_text[64];
            snprintf(meter_text, sizeof(meter_text), "L: %.3f R: %.3f\nPeak L: %.3f R: %.3f", 
                    s_deferred_rms_left, s_deferred_rms_right, 
                    s_deferred_peak_left, s_deferred_peak_right);
            lv_label_set_text(s_meter_label, meter_text);
        }
        
        LV_UNLOCK();
        ESP_LOGI(TAG, "METER_PROC: meter update applied L=%.3f R=%.3f peakL=%.3f peakR=%.3f",
                 s_deferred_rms_left, s_deferred_rms_right, s_deferred_peak_left, s_deferred_peak_right);
        s_meter_update_pending = false;
    }
}

/**
 * @brief LVGL timer callback to apply deferred meter updates in LVGL context.
 * Runs with LVGL lock already held.
 */
static void lvgl_meter_apply_cb(lv_timer_t *timer)
{
    (void)timer;

    if (!s_meter_update_pending && !s_meter_reset_pending) return;

    // Reset handling
    if (s_meter_reset_pending) {
        if (s_meter_bar_l && s_meter_bar_r && s_peak_line_l && s_peak_line_r &&
            lv_obj_is_valid(s_meter_bar_l) && lv_obj_is_valid(s_meter_bar_r) &&
            lv_obj_is_valid(s_peak_line_l) && lv_obj_is_valid(s_peak_line_r)) {
            lv_bar_set_value(s_meter_bar_l, 0, LV_ANIM_ON);
            lv_bar_set_value(s_meter_bar_r, 0, LV_ANIM_ON);
            update_peak_line_position(s_peak_line_l, s_meter_bar_l, 0.0f);
            update_peak_line_position(s_peak_line_r, s_meter_bar_r, 0.0f);
            if (s_meter_label_l && lv_obj_is_valid(s_meter_label_l)) lv_label_set_text(s_meter_label_l, "L: 0.000\nPeak: 0.000");
            if (s_meter_label_r && lv_obj_is_valid(s_meter_label_r)) lv_label_set_text(s_meter_label_r, "R: 0.000\nPeak: 0.000");
        }
        s_meter_reset_pending = false;
        s_meter_update_pending = false;
        return;
    }

    if (s_meter_update_pending) {
        if (s_meter_bar_l && s_meter_bar_r && s_peak_line_l && s_peak_line_r &&
            lv_obj_is_valid(s_meter_bar_l) && lv_obj_is_valid(s_meter_bar_r) &&
            lv_obj_is_valid(s_peak_line_l) && lv_obj_is_valid(s_peak_line_r)) {
            int rms_l_value = (int)(s_deferred_rms_left * 100.0f);
            int rms_r_value = (int)(s_deferred_rms_right * 100.0f);
            if (rms_l_value > 100) rms_l_value = 100;
            if (rms_r_value > 100) rms_r_value = 100;
            lv_bar_set_value(s_meter_bar_l, rms_l_value, LV_ANIM_ON);
            lv_bar_set_value(s_meter_bar_r, rms_r_value, LV_ANIM_ON);
            update_peak_line_position(s_peak_line_l, s_meter_bar_l, s_deferred_peak_left);
            update_peak_line_position(s_peak_line_r, s_meter_bar_r, s_deferred_peak_right);
            if (s_meter_label_l && lv_obj_is_valid(s_meter_label_l)) {
                char label_text[32];
                snprintf(label_text, sizeof(label_text), "L: %.3f\nPeak: %.3f", s_deferred_rms_left, s_deferred_peak_left);
                lv_label_set_text(s_meter_label_l, label_text);
            }
            if (s_meter_label_r && lv_obj_is_valid(s_meter_label_r)) {
                char label_text[32];
                snprintf(label_text, sizeof(label_text), "R: %.3f\nPeak: %.3f", s_deferred_rms_right, s_deferred_peak_right);
                lv_label_set_text(s_meter_label_r, label_text);
            }
        }
        s_meter_update_pending = false;
    }
}

/**
 * @brief Create enhanced dual-channel meter display with peak hold
 */
void wavex_ui_create_meter_display(lv_obj_t* parent)
{
    // Create meter container - full width and height of parent for 3-column layout
    LV_LOCK();
    lv_obj_t *meter_area = lv_obj_create(parent);
    lv_obj_set_size(meter_area, lv_pct(100), lv_pct(100));
    lv_obj_set_style_bg_color(meter_area, lv_color_make(0x1A, 0x1A, 0x1A), LV_PART_MAIN); // Dark gray background to match columns
    lv_obj_set_style_border_width(meter_area, 0, LV_PART_MAIN); // No border since parent column has border
    lv_obj_align(meter_area, LV_ALIGN_TOP_LEFT, 0, 0);

    // Meter title
    lv_obj_t *meter_title = lv_label_create(meter_area);
    lv_label_set_text(meter_title, "Audio Meters");
    lv_obj_set_style_text_color(meter_title, lv_color_white(), LV_PART_MAIN); // White text for dark mode
    lv_obj_set_style_text_font(meter_title, &lv_font_montserrat_18, LV_PART_MAIN);
    lv_obj_align(meter_title, LV_ALIGN_TOP_MID, 0, 5);

    // Left channel container
    lv_obj_t *left_channel = lv_obj_create(meter_area);
    lv_obj_set_size(left_channel, lv_pct(45), lv_pct(70));
    lv_obj_set_style_bg_color(left_channel, lv_color_make(0x2A, 0x2A, 0x2A), LV_PART_MAIN); // Dark gray background
    lv_obj_set_style_border_width(left_channel, 1, LV_PART_MAIN);
    lv_obj_set_style_border_color(left_channel, lv_color_make(0x4C, 0xAF, 0x50), LV_PART_MAIN);
    lv_obj_align(left_channel, LV_ALIGN_LEFT_MID, 0, 0);

    // Left channel label
    lv_obj_t *left_label = lv_label_create(left_channel);
    lv_label_set_text(left_label, "LEFT");
    lv_obj_set_style_text_color(left_label, lv_color_white(), LV_PART_MAIN); // White text for dark mode
    lv_obj_set_style_text_font(left_label, &lv_font_montserrat_14, LV_PART_MAIN);
    lv_obj_align(left_label, LV_ALIGN_TOP_MID, 0, 5);

    // Left channel RMS bar
    s_meter_bar_l = lv_bar_create(left_channel);
    lv_obj_set_size(s_meter_bar_l, lv_pct(80), 20);
    lv_obj_align(s_meter_bar_l, LV_ALIGN_CENTER, 0, -10);
    lv_bar_set_range(s_meter_bar_l, 0, 100);
    lv_bar_set_value(s_meter_bar_l, 0, LV_ANIM_OFF);
    lv_obj_set_style_bg_color(s_meter_bar_l, lv_color_make(0x4C, 0xAF, 0x50), LV_PART_INDICATOR);

    // Left channel peak line (initially hidden) - as child of meter bar
    s_peak_line_l = lv_obj_create(s_meter_bar_l);
    lv_obj_set_size(s_peak_line_l, 2, 20);
    lv_obj_set_style_bg_color(s_peak_line_l, lv_color_make(0xFF, 0x57, 0x22), LV_PART_MAIN);
    lv_obj_set_style_border_width(s_peak_line_l, 0, LV_PART_MAIN);
    lv_obj_set_pos(s_peak_line_l, 0, 0);
    lv_obj_add_flag(s_peak_line_l, LV_OBJ_FLAG_HIDDEN);

