pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
    // Left channel values label
    s_meter_label_l = lv_label_create(left_channel);
    lv_label_set_text(s_meter_label_l, "L: 0.000\nPeak: 0.000");
    lv_obj_set_style_text_color(s_meter_label_l, lv_color_white(), LV_PART_MAIN); // White text for dark mode
    lv_obj_set_style_text_font(s_meter_label_l, &lv_font_montserrat_14, LV_PART_MAIN);
    lv_obj_align(s_meter_label_l, LV_ALIGN_BOTTOM_MID, 0, -5);

    // Right channel container
    lv_obj_t *right_channel = lv_obj_create(meter_area);
    lv_obj_set_size(right_channel, lv_pct(45), lv_pct(70));
    lv_obj_set_style_bg_color(right_channel, lv_color_make(0x2A, 0x2A, 0x2A), LV_PART_MAIN); // Dark gray background
    lv_obj_set_style_border_width(right_channel, 1, LV_PART_MAIN);
    lv_obj_set_style_border_color(right_channel, lv_color_make(0x4C, 0xAF, 0x50), LV_PART_MAIN);
    lv_obj_align(right_channel, LV_ALIGN_RIGHT_MID, 0, 0);

    // Right channel label
    lv_obj_t *right_label = lv_label_create(right_channel);
    lv_label_set_text(right_label, "RIGHT");
    lv_obj_set_style_text_color(right_label, lv_color_white(), LV_PART_MAIN); // White text for dark mode
    lv_obj_set_style_text_font(right_label, &lv_font_montserrat_14, LV_PART_MAIN);
    lv_obj_align(right_label, LV_ALIGN_TOP_MID, 0, 5);

    // Right channel RMS bar
    s_meter_bar_r = lv_bar_create(right_channel);
    lv_obj_set_size(s_meter_bar_r, lv_pct(80), 20);
    lv_obj_align(s_meter_bar_r, LV_ALIGN_CENTER, 0, -10);
    lv_bar_set_range(s_meter_bar_r, 0, 100);
    lv_bar_set_value(s_meter_bar_r, 0, LV_ANIM_OFF);
    lv_obj_set_style_bg_color(s_meter_bar_r, lv_color_make(0x4C, 0xAF, 0x50), LV_PART_INDICATOR);

    // Right channel peak line (initially hidden) - as child of meter bar
    s_peak_line_r = lv_obj_create(s_meter_bar_r);
    lv_obj_set_size(s_peak_line_r, 2, 20);
    lv_obj_set_style_bg_color(s_peak_line_r, lv_color_make(0xFF, 0x57, 0x22), LV_PART_MAIN);
    lv_obj_set_style_border_width(s_peak_line_r, 0, LV_PART_MAIN);
    lv_obj_set_pos(s_peak_line_r, 0, 0);
    lv_obj_add_flag(s_peak_line_r, LV_OBJ_FLAG_HIDDEN);

    // Right channel values label
    s_meter_label_r = lv_label_create(right_channel);
    lv_label_set_text(s_meter_label_r, "R: 0.000\nPeak: 0.000");
    lv_obj_set_style_text_color(s_meter_label_r, lv_color_white(), LV_PART_MAIN); // White text for dark mode
    lv_obj_set_style_text_font(s_meter_label_r, &lv_font_montserrat_14, LV_PART_MAIN);
    lv_obj_align(s_meter_label_r, LV_ALIGN_BOTTOM_MID, 0, -5);

    // Peak hold info label
    lv_obj_t *peak_info = lv_label_create(meter_area);
    lv_label_set_text(peak_info, "Peak Hold: 500ms");
    lv_obj_set_style_text_color(peak_info, lv_color_white(), LV_PART_MAIN); // White text for dark mode
    lv_obj_set_style_text_font(peak_info, &lv_font_montserrat_14, LV_PART_MAIN);
    lv_obj_align(peak_info, LV_ALIGN_BOTTOM_MID, 0, -5);

    // Populate deferred meter values from current backend snapshot so UI can show immediately
    wavex_meter_data_t md;
    inter_mcu_get_meter_data(&md);
    if (md.valid) {
        s_deferred_rms_left = md.rms_left;
        s_deferred_rms_right = md.rms_right;
        s_deferred_peak_left = md.peak_left;
        s_deferred_peak_right = md.peak_right;
    }

    // Mark an initial update so the meters render as soon as the page is created
    s_meter_update_pending = true;
    wavex_ui_mark_content_changed();
    ESP_LOGI(TAG, "METER_UI: meter widgets created and initial update scheduled L=%.3f R=%.3f", s_deferred_rms_left, s_deferred_rms_right);
    // Create LVGL timer to ensure deferred updates are applied in LVGL context
    if (!s_meter_lvgl_timer) {
        s_meter_lvgl_timer = lv_timer_create(lvgl_meter_apply_cb, 50, NULL);
        if (!s_meter_lvgl_timer) {
            ESP_LOGE(TAG, "Failed to create meter LVGL timer");
        }
    }
}

/**
 * @brief Meter data callback from Daisy
 */
static void meter_data_cb(float rms, float peak, void* user_data)
{
    // Debug logging for meter data
    #ifdef WAVEX_LOG_METER_DATA
    ESP_LOGI(TAG, "Meter data received: RMS=%.3f, Peak=%.3f", rms, peak);
    #endif
    
    s_current_rms = rms;
    s_current_peak = peak;
    
    // Call registered callback if any
    if (s_meter_callback) {
        s_meter_callback(rms, peak, s_meter_user_data);
    }
}

/**
 * @brief Touch event callback for testing
 */
static void touch_event_cb(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    lv_obj_t *obj = (lv_obj_t *)lv_event_get_target(e);

    if (code == LV_EVENT_PRESSED) {
        ESP_LOGI(TAG, "Touch pressed on test area");
        // Note: Event callbacks run in LVGL context, no locking needed
        lv_obj_set_style_bg_color(obj, lv_color_make(0xFF, 0xEB, 0x3B), LV_PART_MAIN);
        lv_obj_t *label = lv_obj_get_child(obj, 0);
        if (label) {
            lv_label_set_text(label, "Touch Detected!\nKeep pressing...");
            lv_obj_set_style_text_font(label, &lv_font_montserrat_14, LV_PART_MAIN);  // Normal font
        }
    } else if (code == LV_EVENT_RELEASED) {
        ESP_LOGI(TAG, "Touch released from test area");
        // Note: Event callbacks run in LVGL context, no locking needed
        lv_obj_set_style_bg_color(obj, lv_color_make(0xE3, 0xF2, 0xFD), LV_PART_MAIN);
        lv_obj_t *label = lv_obj_get_child(obj, 0);
        if (label) {
            lv_label_set_text(label, "Touch Test Area\nTap here to test touchscreen!");
            lv_obj_set_style_text_font(label, &lv_font_montserrat_14, LV_PART_MAIN);  // Normal font
        }
    }
}

/**
 * @brief Mark content as changed to trigger refresh
 */
void wavex_ui_mark_content_changed(void)
{
    s_content_changed = true;
}

/**
 * @brief Adaptive refresh rate control for optimal performance
 */
static void adaptive_refresh_control(void)
{
    uint32_t current_time = (uint32_t)(esp_timer_get_time() / 1000); // Convert to ms
    
    // Only refresh if content has changed and enough time has passed
    if (s_content_changed) {
        uint32_t time_since_last_refresh = current_time - s_last_refresh_time;
        
