pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
        // Use minimum refresh interval for responsive updates
        if (time_since_last_refresh >= MIN_REFRESH_INTERVAL_MS) {
            LV_LOCK();
            lv_refr_now(s_lvgl_display);
            LV_UNLOCK();
            
            s_content_changed = false;
            s_last_refresh_time = current_time;
            s_refresh_count++;
            
            // Log refresh rate every 100 refreshes for monitoring
            if (s_refresh_count % 100 == 0) {
                ESP_LOGD(TAG, "Display refresh count: %lu", s_refresh_count);
            }
        }
    }
}

/**
 * @brief Initialize LVGL display using BSP (Recommended approach)
 */
 static esp_err_t init_lvgl_display(void)
 {
     ESP_LOGI(TAG, "Initializing LVGL display using BSP...");

    // Initialize LVGL core
    ESP_LOGI(TAG, "Initializing LVGL...");
    lv_init();

    // Register LVGL log print callback so LVGL logs appear in ESP logs
    #if CONFIG_LV_USE_LOG
    lv_log_register_print_cb(wavex_lvgl_log_cb);
    #endif

    // Check available memory before display initialization
    ESP_LOGI(TAG, "Memory before display init:");
    ESP_LOGI(TAG, "  Free heap: %zu bytes", esp_get_free_heap_size());
    ESP_LOGI(TAG, "  Minimum free heap: %zu bytes", esp_get_minimum_free_heap_size());

    // Use BSP's LVGL display setup with optimized config for higher refresh rates
    ESP_LOGI(TAG, "Using BSP's LVGL display setup with optimized buffer configuration...");
    bsp_display_cfg_t cfg = {
        .lvgl_port_cfg = ESP_LVGL_PORT_INIT_CONFIG(),
        .buffer_size = 720 * 20,   // Optimized: 20 lines × 720px × 2B = 28.8KB
        .double_buffer = true,     // Enable double buffering for smoother updates
        .flags = {
            .buff_dma = true,
            .buff_spiram = false,
            .sw_rotate = true,   // Enable software rotation for HX8394
        }
    };

    s_lvgl_display = bsp_display_start_with_config(&cfg);
    ESP_RETURN_ON_FALSE(s_lvgl_display, ESP_FAIL, TAG, "Failed to start BSP display");

    // BSP disabled mirror operations for HX8394, so we need software rotation
    // Rotate 90 degrees clockwise
    LV_LOCK();
    lv_display_set_rotation(s_lvgl_display, LV_DISPLAY_ROTATION_90);
    LV_UNLOCK();

    // BSP handles touch setup automatically
    ESP_LOGI(TAG, "LVGL display initialized successfully");
    return ESP_OK;
}

// C-compatible LVGL log callback implementation
extern "C" void wavex_lvgl_log_cb(signed char level, const char * buf)
{
    // Map LVGL levels to ESP log levels (simplified)
    switch (level) {
        case 0: // TRACE
        case 1: // INFO
            ESP_LOGI("LVGL", "%s", buf);
            break;
        case 2: // WARN
            ESP_LOGW("LVGL", "%s", buf);
            break;
        case 3: // ERROR
            ESP_LOGE("LVGL", "%s", buf);
            break;
        default:
            ESP_LOGI("LVGL", "%s", buf);
            break;
    }
}

/**
 * @brief Create the hotkey region with 6 buttons at bottom of screen
 */
static void create_hotkey_region(lv_obj_t *parent)
{
    if (parent == NULL) {
        ESP_LOGE(TAG, "create_hotkey_region: parent is NULL");
        return;
    }

    ESP_LOGI(TAG, "Creating hotkey region...");
    LV_LOCK();

    // Create hotkey region container with dark mode styling
    s_hotkey_region = lv_obj_create(parent);
    lv_obj_set_size(s_hotkey_region, lv_pct(100), 100);  // 100px tall, full width
    lv_obj_set_style_bg_color(s_hotkey_region, lv_color_make(0x00, 0x00, 0x00), LV_PART_MAIN); // Black background
    lv_obj_set_style_border_width(s_hotkey_region, 1, LV_PART_MAIN);
    lv_obj_set_style_border_color(s_hotkey_region, lv_color_make(0x33, 0x33, 0x33), LV_PART_MAIN); // Dark gray border
    lv_obj_set_style_pad_all(s_hotkey_region, 5, LV_PART_MAIN);
    lv_obj_align(s_hotkey_region, LV_ALIGN_BOTTOM_MID, 0, 0);

    // Set flex layout for horizontal arrangement of buttons
    lv_obj_set_flex_flow(s_hotkey_region, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(s_hotkey_region, LV_FLEX_ALIGN_SPACE_EVENLY, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);

    // Create 6 hotkey buttons with dynamic sizing (will be updated by update_hotkey_labels)
    for (int i = 0; i < 6; i++) {
        s_hotkey_buttons[i] = lv_btn_create(s_hotkey_region);
        lv_obj_set_size(s_hotkey_buttons[i], lv_pct(16), 90);  // Default 16% width, will be updated dynamically
        
        // Blue button styling with white text (matching main screen buttons)
        lv_obj_set_style_bg_color(s_hotkey_buttons[i], lv_color_make(0x21, 0x96, 0xF3), LV_PART_MAIN); // Blue background
        lv_obj_set_style_bg_color(s_hotkey_buttons[i], lv_color_make(0x19, 0x76, 0xD2), LV_PART_MAIN | LV_STATE_PRESSED); // Darker blue when pressed
        lv_obj_set_style_border_width(s_hotkey_buttons[i], 2, LV_PART_MAIN);
        lv_obj_set_style_border_color(s_hotkey_buttons[i], lv_color_make(0x15, 0x65, 0xC0), LV_PART_MAIN); // Darker blue border
        lv_obj_set_style_radius(s_hotkey_buttons[i], 5, LV_PART_MAIN);
        
        // Ensure button can receive input events
        lv_obj_clear_flag(s_hotkey_buttons[i], LV_OBJ_FLAG_HIDDEN);
        lv_obj_clear_flag(s_hotkey_buttons[i], LV_OBJ_FLAG_CLICKABLE);
        lv_obj_add_flag(s_hotkey_buttons[i], LV_OBJ_FLAG_CLICKABLE);
        
        // Add event callbacks for all touch events
        lv_obj_add_event_cb(s_hotkey_buttons[i], hotkey_button_event_cb, LV_EVENT_CLICKED, (void*)(intptr_t)i);
        lv_obj_add_event_cb(s_hotkey_buttons[i], hotkey_button_event_cb, LV_EVENT_PRESSED, (void*)(intptr_t)i);
        lv_obj_add_event_cb(s_hotkey_buttons[i], hotkey_button_event_cb, LV_EVENT_RELEASED, (void*)(intptr_t)i);
        
        // Create label for button with white text
        s_hotkey_labels[i] = lv_label_create(s_hotkey_buttons[i]);
        lv_label_set_text(s_hotkey_labels[i], "");  // Empty initially
        lv_obj_set_style_text_font(s_hotkey_labels[i], &lv_font_montserrat_36, LV_PART_MAIN);
        lv_obj_set_style_text_color(s_hotkey_labels[i], lv_color_white(), LV_PART_MAIN); // White text
        lv_obj_center(s_hotkey_labels[i]);
    }

