pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
    LV_UNLOCK();
    ESP_LOGI(TAG, "Hotkey region created successfully with 6 buttons");
}

/**
 * @brief Update hotkey labels based on current screen context
 */
void wavex_ui_update_hotkey_labels(const char* labels[6])
{
    if (s_hotkey_labels[0] == NULL) {
        ESP_LOGW(TAG, "Hotkey labels not initialized");
        return;
    }

    // Count number of active labels
    int num_active_labels = 0;
    for (int i = 0; i < 6; i++) {
        if (labels[i] && strlen(labels[i]) > 0) {
            num_active_labels++;
        }
    }

    // Calculate dynamic button widths
    int button_widths[6];
    calculate_hotkey_layout(num_active_labels, button_widths);

    LV_LOCK();
    for (int i = 0; i < 6; i++) {
        if (s_hotkey_labels[i] && lv_obj_is_valid(s_hotkey_labels[i])) {
            if (labels[i] && strlen(labels[i]) > 0) {
                lv_label_set_text(s_hotkey_labels[i], labels[i]);
                lv_obj_clear_flag(s_hotkey_buttons[i], LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(s_hotkey_buttons[i], LV_OBJ_FLAG_CLICKABLE);
                // Update button width based on calculated layout
                lv_obj_set_size(s_hotkey_buttons[i], lv_pct(button_widths[i]), 90);
            } else {
                lv_label_set_text(s_hotkey_labels[i], "");
                lv_obj_add_flag(s_hotkey_buttons[i], LV_OBJ_FLAG_HIDDEN);
                lv_obj_clear_flag(s_hotkey_buttons[i], LV_OBJ_FLAG_CLICKABLE);
            }
        }
    }
    LV_UNLOCK();
    
    ESP_LOGI(TAG, "Updated hotkey labels: %d active items, layout: %d%% %d%% %d%% %d%% %d%% %d%%", 
             num_active_labels, button_widths[0], button_widths[1], button_widths[2], 
             button_widths[3], button_widths[4], button_widths[5]);
}

/**
 * @brief Clear all hotkey labels
 */
static void clear_hotkey_labels(void)
{
    const char* empty_labels[6] = {"", "", "", "", "", ""};
    wavex_ui_update_hotkey_labels(empty_labels);
}

/**
 * @brief Calculate dynamic hotkey button layout based on number of items
 */
static void calculate_hotkey_layout(int num_items, int* button_widths)
{
    // 6 slots total, distribute based on number of items
    int slots_per_button = 6 / num_items;
    int remaining_slots = 6 % num_items;
    
    for (int i = 0; i < 6; i++) {
        if (i < num_items) {
            // Each button gets base slots plus potentially one extra slot
            int slots = slots_per_button + (i < remaining_slots ? 1 : 0);
            button_widths[i] = (slots * 100) / 6; // Convert to percentage
        } else {
            button_widths[i] = 0; // Hidden buttons
        }
    }
}

/**
 * @brief Set current screen context for hotkey mapping
 */
void wavex_ui_set_screen_context(const char* screen_name)
{
    s_current_screen = screen_name;
}

/**
 * @brief Update header title
 */
void wavex_ui_update_header_title(const char* title)
{
    if (s_header_title && lv_obj_is_valid(s_header_title)) {
        LV_LOCK();
        lv_label_set_text(s_header_title, title);
        LV_UNLOCK();
    }
}

/**
 * @brief Update hotkey label for a specific button
 */
void wavex_ui_update_hotkey_label(int button_index, const char* label)
{
    if (button_index < 0 || button_index >= 6 || !s_hotkey_labels[button_index]) {
        ESP_LOGW(TAG, "Invalid hotkey button index: %d", button_index);
        return;
    }
    
    LV_LOCK();
    if (lv_obj_is_valid(s_hotkey_labels[button_index])) {
        lv_label_set_text(s_hotkey_labels[button_index], label);
    }
    LV_UNLOCK();
}

/**
 * @brief Hotkey button event callback
 */
static void hotkey_button_event_cb(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    int button_index = (int)(intptr_t)lv_event_get_user_data(e);

    ESP_LOGI(TAG, "Hotkey button event: code=%d, button=%d, screen=%s", code, button_index, s_current_screen);

    if (code == LV_EVENT_CLICKED) {
        ESP_LOGI(TAG, "Hotkey button %d clicked on screen %s", button_index, s_current_screen);
        
        // Handle hotkey actions based on current screen context
        if (s_content_area == NULL || !lv_obj_is_valid(s_content_area)) {
            ESP_LOGE(TAG, "Content area not available for hotkey navigation");
            return;
        }
        
        // Lock LVGL for thread safety
        LV_LOCK();
        
        // Map button index to hotkey actions based on current screen
        if (strcmp(s_current_screen, "main") == 0) {
            // Main menu: Sample, System
            switch (button_index) {
                case 0: // Sample
                    ESP_LOGI(TAG, "Hotkey: Navigating to sample menu");
                    create_sample_menu(s_content_area);
                    break;
                case 1: // System
                    ESP_LOGI(TAG, "Hotkey: Navigating to system menu");
                    create_system_menu(s_content_area);
                    break;
                default:
                    ESP_LOGW(TAG, "Unknown hotkey button index for main menu: %d", button_index);
                    break;
            }
        } else if (strcmp(s_current_screen, "sample") == 0) {
            // Sample menu: Record, Edit, Load/Save, Back
            switch (button_index) {
                case 0: // Record
                    ESP_LOGI(TAG, "Hotkey: Record option selected");
                    // TODO: Implement record functionality
                    break;
                case 1: // Edit
                    ESP_LOGI(TAG, "Hotkey: Edit option selected");
                    // TODO: Implement edit functionality
                    break;
                case 2: // Load/Save
                    ESP_LOGI(TAG, "Hotkey: Load/Save option selected");
                    create_sample_load_save_page(s_content_area);
                    break;
                case 3: // Back
                    ESP_LOGI(TAG, "Hotkey: Navigating back to main menu");
                    create_main_menu(s_content_area);
                    break;
                default:
                    ESP_LOGW(TAG, "Unknown hotkey button index for sample menu: %d", button_index);
                    break;
            }
        } else if (strcmp(s_current_screen, "system") == 0) {
            // System menu: Diagnostics, Settings, Back
            switch (button_index) {
                case 0: // Diagnostics
                    ESP_LOGI(TAG, "Hotkey: Navigating to diagnostics page");
                    diagnostics_page_create(s_content_area);
                    diagnostics_page_init();
                    break;
                case 1: // Settings
                    ESP_LOGI(TAG, "Hotkey: Settings option selected");
                    // TODO: Implement settings functionality
                    break;
                case 2: // Back
                    ESP_LOGI(TAG, "Hotkey: Navigating back to main menu");
                    create_main_menu(s_content_area);
                    break;
                default:
                    ESP_LOGW(TAG, "Unknown hotkey button index for system menu: %d", button_index);
                    break;
            }
        } else if (strcmp(s_current_screen, "diagnostics") == 0) {
            // Diagnostics page: Back
            switch (button_index) {
                case 0: // Back
                    ESP_LOGI(TAG, "Hotkey: Navigating back to system menu");
                    diagnostics_page_stop();
                    create_system_menu(s_content_area);
                    break;
                default:
                    ESP_LOGW(TAG, "Unknown hotkey button index for diagnostics page: %d", button_index);
                    break;
            }
        } else if (strcmp(s_current_screen, "sample_load_save") == 0) {
            // Sample Load/Save page: Audition, Load, Up, Down, Select, Back
            switch (button_index) {
                case 0: // Audition/Stop
                    ESP_LOGI(TAG, "Hotkey: Audition/Stop sample");
                    if (s_sample_load_save_page) {
                        if (s_sample_load_save_page->is_playing) {
                            // Stop current audition
                            ESP_LOGI(TAG, "Stopping current audition");
                            wavex_sample_load_save_stop_audition(s_sample_load_save_page);
                            // Don't update button text immediately - wait for stop response
                        } else {
                            // Start new audition
                            const wavex_file_entry_t* selected = wavex_file_browser_get_selected(s_sample_load_save_page->file_browser);
                            if (selected && !selected->is_directory) {
                                // Use index-based audition for better performance
                                uint32_t selected_index = wavex_file_browser_get_selected_index(s_sample_load_save_page->file_browser);
                                wavex_sample_load_save_audition_sample_by_index(s_sample_load_save_page, selected_index);
                                // Update button text to "Stop"
                                wavex_ui_update_hotkey_label(0, "Stop");
                            } else {
                                ESP_LOGW(TAG, "No valid file selected for audition");
                            }
                        }
                    }
                    break;
                case 1: // Load
                    ESP_LOGI(TAG, "Hotkey: Load sample");
                    if (s_sample_load_save_page) {
                        const wavex_file_entry_t* selected = wavex_file_browser_get_selected(s_sample_load_save_page->file_browser);
                        if (selected && !selected->is_directory) {
                            wavex_sample_load_save_load_sample(s_sample_load_save_page, selected->path);
                        }
                    }
                    break;
                case 2: // Up Arrow
                    ESP_LOGI(TAG, "Hotkey: Navigate up in file list");
                    if (s_sample_load_save_page && s_sample_load_save_page->file_browser) {
                        uint32_t current_idx = wavex_file_browser_get_selected_index(s_sample_load_save_page->file_browser);
                        if (current_idx > 0) {
                            wavex_file_browser_set_selection(s_sample_load_save_page->file_browser, current_idx - 1);
                            ESP_LOGI(TAG, "Navigated up to index %d", current_idx - 1);
                        }
                    }
                    break;
                case 3: // Down Arrow
                    ESP_LOGI(TAG, "Hotkey: Navigate down in file list");
                    if (s_sample_load_save_page && s_sample_load_save_page->file_browser) {
                        uint32_t current_idx = wavex_file_browser_get_selected_index(s_sample_load_save_page->file_browser);
                        uint32_t max_idx = wavex_file_browser_get_entry_count(s_sample_load_save_page->file_browser);
                        if (current_idx < max_idx - 1) {
                            wavex_file_browser_set_selection(s_sample_load_save_page->file_browser, current_idx + 1);
                            ESP_LOGI(TAG, "Navigated down to index %d", current_idx + 1);
                        }
                    }
                    break;
                case 4: // Select
                    ESP_LOGI(TAG, "Hotkey: Select action");
                    if (s_sample_load_save_page) {
                        const wavex_file_entry_t* selected = wavex_file_browser_get_selected(s_sample_load_save_page->file_browser);
                        if (selected) {
                            if (selected->is_directory) {
                                // Enter directory
                                ESP_LOGI(TAG, "Entering directory: %s", selected->name);
                                wavex_file_browser_navigate_to(s_sample_load_save_page->file_browser, selected->path);
                            } else {
                                // Show file metadata
                                ESP_LOGI(TAG, "Showing metadata for file: %s", selected->name);
                                wavex_sample_load_save_update_info(s_sample_load_save_page, selected);
                            }
                        }
                    }
                    break;
                case 5: // Back
                    ESP_LOGI(TAG, "Hotkey: Back action");
                    if (s_sample_load_save_page) {
                        // Try to navigate up one directory level first
                        if (wavex_file_browser_navigate_up(s_sample_load_save_page->file_browser)) {
                            ESP_LOGI(TAG, "Navigated up one directory level");
                        } else {
                            // If we're at root, go back to sample menu
                            ESP_LOGI(TAG, "At root directory, navigating back to sample menu");
                            wavex_sample_load_save_destroy(s_sample_load_save_page);
                            s_sample_load_save_page = NULL;
                            create_sample_menu(s_content_area);
                        }
                    } else {
                        ESP_LOGW(TAG, "Sample load/save page is NULL, cannot navigate back");
                    }
                    break;
                default:
                    ESP_LOGW(TAG, "Unknown hotkey button index for sample load/save page: %d", button_index);
                    break;
            }
        } else {
            ESP_LOGW(TAG, "Unknown screen context for hotkey: %s", s_current_screen);
        }
    } else if (code == LV_EVENT_PRESSED) {
        ESP_LOGI(TAG, "Hotkey button %d pressed", button_index);
    } else if (code == LV_EVENT_RELEASED) {
        ESP_LOGI(TAG, "Hotkey button %d released", button_index);
    }
    
