pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
    // Unlock LVGL
    LV_UNLOCK();
}

/**
 * @brief Create the main menu with navigation buttons
 */
static void create_main_menu(lv_obj_t *parent)
{
    if (parent == NULL) {
        ESP_LOGE(TAG, "create_main_menu: parent is NULL");
        return;
    }

    ESP_LOGI(TAG, "Creating main menu...");
    LV_LOCK();
    // Clear parent content
    lv_obj_clean(parent);

    // Set screen context for hotkey mapping
    wavex_ui_set_screen_context("main");
    
    // Update header title
    wavex_ui_update_header_title("Main Menu");

    // Create a flex container for menu buttons (optimized for landscape)
    lv_obj_t *menu_cont = lv_obj_create(parent);
    lv_obj_set_size(menu_cont, lv_pct(95), lv_pct(100));  // Use full height since no title/back button
    lv_obj_set_style_bg_color(menu_cont, lv_color_make(0x00, 0x00, 0x00), LV_PART_MAIN); // Black background for dark mode
    lv_obj_set_style_border_width(menu_cont, 2, LV_PART_MAIN);
    lv_obj_set_style_border_color(menu_cont, lv_color_make(0x33, 0x33, 0x33), LV_PART_MAIN); // Dark gray border
    lv_obj_set_style_pad_all(menu_cont, 15, LV_PART_MAIN);  // Reduced padding
    lv_obj_center(menu_cont);

    // Set flex layout for landscape mode - horizontal layout for 2 buttons
    lv_obj_set_flex_flow(menu_cont, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(menu_cont, LV_FLEX_ALIGN_SPACE_EVENLY, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);

    // Create Sample button with blue styling
    lv_obj_t *btn1 = lv_btn_create(menu_cont);
    lv_obj_set_size(btn1, lv_pct(45), 120);  // Increased height for larger font
    lv_obj_add_event_cb(btn1, menu_button_event_cb, LV_EVENT_CLICKED, (void*)"sample");
    lv_obj_set_style_bg_color(btn1, lv_color_make(0x21, 0x96, 0xF3), LV_PART_MAIN); // Blue background
    lv_obj_set_style_bg_color(btn1, lv_color_make(0x19, 0x76, 0xD2), LV_PART_MAIN | LV_STATE_PRESSED); // Darker blue when pressed
    lv_obj_set_style_border_width(btn1, 2, LV_PART_MAIN);
    lv_obj_set_style_border_color(btn1, lv_color_make(0x15, 0x65, 0xC0), LV_PART_MAIN); // Darker blue border
    lv_obj_set_style_radius(btn1, 5, LV_PART_MAIN);
    lv_obj_t *label1 = lv_label_create(btn1);
    lv_label_set_text(label1, "Sample");
    lv_obj_set_style_text_font(label1, &lv_font_montserrat_22, LV_PART_MAIN);
    lv_obj_set_style_text_color(label1, lv_color_white(), LV_PART_MAIN); // White text
    lv_obj_center(label1);

    // Create System button with blue styling
    lv_obj_t *btn2 = lv_btn_create(menu_cont);
    lv_obj_set_size(btn2, lv_pct(45), 120);
    lv_obj_add_event_cb(btn2, menu_button_event_cb, LV_EVENT_CLICKED, (void*)"system");
    lv_obj_set_style_bg_color(btn2, lv_color_make(0x21, 0x96, 0xF3), LV_PART_MAIN); // Blue background
    lv_obj_set_style_bg_color(btn2, lv_color_make(0x19, 0x76, 0xD2), LV_PART_MAIN | LV_STATE_PRESSED); // Darker blue when pressed
    lv_obj_set_style_border_width(btn2, 2, LV_PART_MAIN);
    lv_obj_set_style_border_color(btn2, lv_color_make(0x15, 0x65, 0xC0), LV_PART_MAIN); // Darker blue border
    lv_obj_set_style_radius(btn2, 5, LV_PART_MAIN);
    lv_obj_t *label2 = lv_label_create(btn2);
    lv_label_set_text(label2, "System");
    lv_obj_set_style_text_font(label2, &lv_font_montserrat_22, LV_PART_MAIN);
    lv_obj_set_style_text_color(label2, lv_color_white(), LV_PART_MAIN); // White text
    lv_obj_center(label2);
    
    // Update hotkey labels for main menu
    const char* main_menu_labels[6] = {"Sample", "System", "", "", "", ""};
    wavex_ui_update_hotkey_labels(main_menu_labels);
    
    LV_UNLOCK();
}

/**
 * @brief Create the sample submenu
 */
static void create_sample_menu(lv_obj_t *parent)
{
    if (parent == NULL) {
        ESP_LOGE(TAG, "create_sample_menu: parent is NULL");
        return;
    }

    ESP_LOGI(TAG, "Creating sample menu...");
    LV_LOCK();
    // Clear parent content
    lv_obj_clean(parent);

    // Set screen context for hotkey mapping
    wavex_ui_set_screen_context("sample");
    
    // Update header title
    wavex_ui_update_header_title("Sample Menu");

    // Create a flex container for sample options (optimized for landscape)
    lv_obj_t *menu_cont = lv_obj_create(parent);
    LV_UNLOCK();
    lv_obj_set_size(menu_cont, lv_pct(95), lv_pct(100));  // Use full height since no title/back button
    lv_obj_set_style_bg_color(menu_cont, lv_color_make(0x00, 0x00, 0x00), LV_PART_MAIN); // Black background for dark mode
    lv_obj_set_style_border_width(menu_cont, 2, LV_PART_MAIN);
    lv_obj_set_style_border_color(menu_cont, lv_color_make(0x33, 0x33, 0x33), LV_PART_MAIN); // Dark gray border
    lv_obj_set_style_pad_all(menu_cont, 15, LV_PART_MAIN);  // Reduced padding
    lv_obj_center(menu_cont);

    // Set flex layout for landscape mode - horizontal layout
    lv_obj_set_flex_flow(menu_cont, LV_FLEX_FLOW_ROW_WRAP);
    lv_obj_set_flex_align(menu_cont, LV_FLEX_ALIGN_SPACE_EVENLY, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);

    // Sample options (side by side for landscape) - adjusted sizing with blue styling
    lv_obj_t *btn1 = lv_btn_create(menu_cont);
    lv_obj_set_size(btn1, lv_pct(30), 100);  // Increased height for larger font
    lv_obj_add_event_cb(btn1, menu_button_event_cb, LV_EVENT_CLICKED, (void*)"record");
    lv_obj_set_style_bg_color(btn1, lv_color_make(0x21, 0x96, 0xF3), LV_PART_MAIN); // Blue background
    lv_obj_set_style_bg_color(btn1, lv_color_make(0x19, 0x76, 0xD2), LV_PART_MAIN | LV_STATE_PRESSED); // Darker blue when pressed
    lv_obj_set_style_border_width(btn1, 2, LV_PART_MAIN);
    lv_obj_set_style_border_color(btn1, lv_color_make(0x15, 0x65, 0xC0), LV_PART_MAIN); // Darker blue border
    lv_obj_set_style_radius(btn1, 5, LV_PART_MAIN);
    lv_obj_t *label1 = lv_label_create(btn1);
    lv_label_set_text(label1, "Record");
    lv_obj_set_style_text_font(label1, &lv_font_montserrat_22, LV_PART_MAIN);
    lv_obj_set_style_text_color(label1, lv_color_white(), LV_PART_MAIN); // White text
    lv_obj_center(label1);

    lv_obj_t *btn2 = lv_btn_create(menu_cont);
    lv_obj_set_size(btn2, lv_pct(30), 100);
    lv_obj_add_event_cb(btn2, menu_button_event_cb, LV_EVENT_CLICKED, (void*)"edit");
    lv_obj_set_style_bg_color(btn2, lv_color_make(0x21, 0x96, 0xF3), LV_PART_MAIN); // Blue background
    lv_obj_set_style_bg_color(btn2, lv_color_make(0x19, 0x76, 0xD2), LV_PART_MAIN | LV_STATE_PRESSED); // Darker blue when pressed
    lv_obj_set_style_border_width(btn2, 2, LV_PART_MAIN);
    lv_obj_set_style_border_color(btn2, lv_color_make(0x15, 0x65, 0xC0), LV_PART_MAIN); // Darker blue border
    lv_obj_set_style_radius(btn2, 5, LV_PART_MAIN);
    lv_obj_t *label2 = lv_label_create(btn2);
    lv_label_set_text(label2, "Edit");
    lv_obj_set_style_text_font(label2, &lv_font_montserrat_22, LV_PART_MAIN);
    lv_obj_set_style_text_color(label2, lv_color_white(), LV_PART_MAIN); // White text
    lv_obj_center(label2);

    lv_obj_t *btn3 = lv_btn_create(menu_cont);
    lv_obj_set_size(btn3, lv_pct(30), 100);
    lv_obj_add_event_cb(btn3, menu_button_event_cb, LV_EVENT_CLICKED, (void*)"load_save");
    lv_obj_set_style_bg_color(btn3, lv_color_make(0x21, 0x96, 0xF3), LV_PART_MAIN); // Blue background
    lv_obj_set_style_bg_color(btn3, lv_color_make(0x19, 0x76, 0xD2), LV_PART_MAIN | LV_STATE_PRESSED); // Darker blue when pressed
    lv_obj_set_style_border_width(btn3, 2, LV_PART_MAIN);
    lv_obj_set_style_border_color(btn3, lv_color_make(0x15, 0x65, 0xC0), LV_PART_MAIN); // Darker blue border
    lv_obj_set_style_radius(btn3, 5, LV_PART_MAIN);
    lv_obj_t *label3 = lv_label_create(btn3);
    lv_label_set_text(label3, "Load/Save");
    lv_obj_set_style_text_font(label3, &lv_font_montserrat_22, LV_PART_MAIN);
    lv_obj_set_style_text_color(label3, lv_color_white(), LV_PART_MAIN); // White text
    lv_obj_center(label3);
    
    // Update hotkey labels for sample menu
    const char* sample_menu_labels[6] = {"Record", "Edit", "Load/Save", "Back", "", ""};
    wavex_ui_update_hotkey_labels(sample_menu_labels);
    
