pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
    LV_UNLOCK();
}

/**
 * @brief Create the system submenu
 */
static void create_system_menu(lv_obj_t *parent)
{
    if (parent == NULL) {
        ESP_LOGE(TAG, "create_system_menu: parent is NULL");
        return;
    }

    ESP_LOGI(TAG, "Creating system menu...");
    LV_LOCK();
    // Clear parent content
    lv_obj_clean(parent);

    // Set screen context for hotkey mapping
    wavex_ui_set_screen_context("system");
    
    // Update header title
    wavex_ui_update_header_title("System Menu");

    // Create a flex container for system options (optimized for landscape)
    lv_obj_t *menu_cont = lv_obj_create(parent);
    lv_obj_set_size(menu_cont, lv_pct(95), lv_pct(100));  // Use full height since no title/back button
    lv_obj_set_style_bg_color(menu_cont, lv_color_make(0x00, 0x00, 0x00), LV_PART_MAIN); // Black background for dark mode
    lv_obj_set_style_border_width(menu_cont, 2, LV_PART_MAIN);
    lv_obj_set_style_border_color(menu_cont, lv_color_make(0x33, 0x33, 0x33), LV_PART_MAIN); // Dark gray border
    lv_obj_set_style_pad_all(menu_cont, 15, LV_PART_MAIN);  // Reduced padding
    lv_obj_center(menu_cont);

    // Set flex layout for landscape mode - horizontal layout
    lv_obj_set_flex_flow(menu_cont, LV_FLEX_FLOW_ROW_WRAP);
    lv_obj_set_flex_align(menu_cont, LV_FLEX_ALIGN_SPACE_EVENLY, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);

    // System options (side by side for landscape) - adjusted sizing with blue styling
    lv_obj_t *btn1 = lv_btn_create(menu_cont);
    lv_obj_set_size(btn1, lv_pct(45), 100);  // Increased height for larger font
    lv_obj_add_event_cb(btn1, menu_button_event_cb, LV_EVENT_CLICKED, (void*)"diagnostics");
    lv_obj_set_style_bg_color(btn1, lv_color_make(0x21, 0x96, 0xF3), LV_PART_MAIN); // Blue background
    lv_obj_set_style_bg_color(btn1, lv_color_make(0x19, 0x76, 0xD2), LV_PART_MAIN | LV_STATE_PRESSED); // Darker blue when pressed
    lv_obj_set_style_border_width(btn1, 2, LV_PART_MAIN);
    lv_obj_set_style_border_color(btn1, lv_color_make(0x15, 0x65, 0xC0), LV_PART_MAIN); // Darker blue border
    lv_obj_set_style_radius(btn1, 5, LV_PART_MAIN);
    lv_obj_t *label1 = lv_label_create(btn1);
    lv_label_set_text(label1, "Diagnostics");
    lv_obj_set_style_text_font(label1, &lv_font_montserrat_22, LV_PART_MAIN);
    lv_obj_set_style_text_color(label1, lv_color_white(), LV_PART_MAIN); // White text
    lv_obj_center(label1);

    lv_obj_t *btn2 = lv_btn_create(menu_cont);
    lv_obj_set_size(btn2, lv_pct(45), 100);
    lv_obj_add_event_cb(btn2, menu_button_event_cb, LV_EVENT_CLICKED, (void*)"settings");
    lv_obj_set_style_bg_color(btn2, lv_color_make(0x21, 0x96, 0xF3), LV_PART_MAIN); // Blue background
    lv_obj_set_style_bg_color(btn2, lv_color_make(0x19, 0x76, 0xD2), LV_PART_MAIN | LV_STATE_PRESSED); // Darker blue when pressed
    lv_obj_set_style_border_width(btn2, 2, LV_PART_MAIN);
    lv_obj_set_style_border_color(btn2, lv_color_make(0x15, 0x65, 0xC0), LV_PART_MAIN); // Darker blue border
    lv_obj_set_style_radius(btn2, 5, LV_PART_MAIN);
    lv_obj_t *label2 = lv_label_create(btn2);
    lv_label_set_text(label2, "Settings");
    lv_obj_set_style_text_font(label2, &lv_font_montserrat_22, LV_PART_MAIN);
    lv_obj_set_style_text_color(label2, lv_color_white(), LV_PART_MAIN); // White text
    lv_obj_center(label2);
    
    // Update hotkey labels for system menu
    const char* system_menu_labels[6] = {"Diagnostics", "Settings", "Back", "", "", ""};
    wavex_ui_update_hotkey_labels(system_menu_labels);
    
    LV_UNLOCK();
}

/**
 * @brief Create the sample load/save page
 */
static void create_sample_load_save_page(lv_obj_t *parent)
{
    if (parent == NULL) {
        ESP_LOGE(TAG, "create_sample_load_save_page: parent is NULL");
        return;
    }

    ESP_LOGI(TAG, "Creating sample load/save page...");
    LV_LOCK();
    
    // Clear parent content
    lv_obj_clean(parent);

    // Set screen context for hotkey mapping
    wavex_ui_set_screen_context("sample_load_save");
    
    // Update header title
    wavex_ui_update_header_title("Sample Load/Save");

    // Destroy existing page if it exists
    if (s_sample_load_save_page) {
        wavex_sample_load_save_destroy(s_sample_load_save_page);
        s_sample_load_save_page = NULL;
    }

    // Create the proper sample load/save page with file browser
    s_sample_load_save_page = wavex_sample_load_save_create(parent);
    if (!s_sample_load_save_page) {
        ESP_LOGE(TAG, "Failed to create sample load/save page");
        // Fall back to test page
        lv_obj_t* container = lv_obj_create(parent);
        lv_obj_set_size(container, lv_pct(100), lv_pct(100));
        lv_obj_set_style_bg_color(container, lv_color_make(0x00, 0x00, 0x00), LV_PART_MAIN);
        lv_obj_set_style_border_width(container, 2, LV_PART_MAIN);
        lv_obj_set_style_border_color(container, lv_color_make(0x33, 0x33, 0x33), LV_PART_MAIN);
        lv_obj_align(container, LV_ALIGN_TOP_LEFT, 0, 0);
        
        lv_obj_t* test_label = lv_label_create(container);
        lv_label_set_text(test_label, "Sample Load/Save Page\n\nFile Browser failed to load\n\nUse hotkeys: Audition, Load, Save, Back");
        lv_obj_set_style_text_color(test_label, lv_color_white(), LV_PART_MAIN);
        lv_obj_set_style_text_font(test_label, &lv_font_montserrat_18, LV_PART_MAIN);
        lv_obj_center(test_label);
    } else {
        ESP_LOGI(TAG, "Sample load/save page created successfully with file browser");
    }
    
    // Update hotkey labels for sample load/save page
    const char* load_save_labels[6] = {"Audition", "Load", "Up", "Down", "Select", "Back"};
    wavex_ui_update_hotkey_labels(load_save_labels);
    
    ESP_LOGI(TAG, "Sample load/save page creation completed");
    LV_UNLOCK();
}

/**
 * @brief Menu button event callback
 */
static void menu_button_event_cb(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    const char *btn_id = (const char *)lv_event_get_user_data(e);

