pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
    if (code == LV_EVENT_CLICKED) {
        if (btn_id == NULL) {
            ESP_LOGE(TAG, "Menu button clicked with NULL ID");
            return;
        }

        ESP_LOGI(TAG, "Menu button clicked: %s", btn_id);

        // Use the stored content area reference
        if (s_content_area == NULL) {
            ESP_LOGE(TAG, "Content area not initialized for menu navigation");
            return;
        }
        
        // Additional safety check
        if (!lv_obj_is_valid(s_content_area)) {
            ESP_LOGE(TAG, "Content area is not a valid LVGL object");
            return;
        }

        if (strcmp(btn_id, "sample") == 0) {
            ESP_LOGI(TAG, "Navigating to sample menu...");
            create_sample_menu(s_content_area);
        } else if (strcmp(btn_id, "system") == 0) {
            ESP_LOGI(TAG, "Navigating to system menu...");
            create_system_menu(s_content_area);
        } else if (strcmp(btn_id, "record") == 0) {
            ESP_LOGI(TAG, "Record option selected");
            // TODO: Implement record functionality
        } else if (strcmp(btn_id, "edit") == 0) {
            ESP_LOGI(TAG, "Edit option selected");
            // TODO: Implement edit functionality
        } else if (strcmp(btn_id, "load_save") == 0) {
            ESP_LOGI(TAG, "Load/Save option selected");
            create_sample_load_save_page(s_content_area);
        } else if (strcmp(btn_id, "settings") == 0) {
            ESP_LOGI(TAG, "Settings option selected");
            // TODO: Implement settings functionality
        } else if (strcmp(btn_id, "diagnostics") == 0) {
            ESP_LOGI(TAG, "Navigating to diagnostics page...");
            diagnostics_page_create(s_content_area);
            diagnostics_page_init();
        } else if (strcmp(btn_id, "back_main") == 0) {
            ESP_LOGI(TAG, "Navigating back to main menu...");
            create_main_menu(s_content_area);
        } else if (strcmp(btn_id, "back_system") == 0) {
            ESP_LOGI(TAG, "Navigating back to system menu...");
            diagnostics_page_stop();
            create_system_menu(s_content_area);
        } else {
            ESP_LOGI(TAG, "Menu option '%s' selected", btn_id);
        }
    }
}

/**
 * @brief UI task implementation
 */
 static void ui_task(void *pvParameters)
 {
    ESP_LOGI(TAG, "UI task started with full UI support");

    // Initialize LVGL display
    ESP_LOGI(TAG, "Initializing LVGL display...");

    // Initialize LVGL display
    esp_err_t lvgl_ret = init_lvgl_display();
    if (lvgl_ret != ESP_OK) {
         ESP_LOGE(TAG, "Failed to initialize LVGL display: %s", esp_err_to_name(lvgl_ret));
         vTaskDelete(NULL);
         return;
    }

    ESP_LOGI(TAG, "LVGL display initialized successfully");

    // Log memory status
    ESP_LOGI(TAG, "Memory after display init:");
    ESP_LOGI(TAG, "  Free heap: %zu bytes", esp_get_free_heap_size());

    // Create the main UI with dark mode
    ESP_LOGI(TAG, "Creating main UI...");
    LV_LOCK();
    lv_obj_t *main_screen = lv_screen_active();
    lv_obj_set_style_bg_color(main_screen, lv_color_make(0x00, 0x00, 0x00), LV_PART_MAIN); // Black background for dark mode
    
    // Create header (increased size by 50% for better visibility)
    lv_obj_t *header = lv_obj_create(main_screen);
    lv_obj_set_size(header, lv_pct(100), 75);  // Increased from 50 to 75 (50% increase)
    lv_obj_set_style_bg_color(header, lv_color_make(0x2E, 0x34, 0x40), LV_PART_MAIN); // Keep dark gray for contrast
    lv_obj_set_style_border_width(header, 0, LV_PART_MAIN);
    lv_obj_align(header, LV_ALIGN_TOP_MID, 0, 0);
    
    // Add title to header (larger font to match increased header size)
    s_header_title = lv_label_create(header);
    lv_label_set_text(s_header_title, "Main Menu");
    lv_obj_set_style_text_color(s_header_title, lv_color_white(), LV_PART_MAIN);
    lv_obj_set_style_text_font(s_header_title, &lv_font_montserrat_32, LV_PART_MAIN); // Increased from 22 to 32
    lv_obj_center(s_header_title);
    
    // Create content area (adjusted for landscape mode with hotkey region) with dark mode
    lv_obj_t *content = lv_obj_create(main_screen);
    lv_obj_set_size(content, lv_pct(100), 545);  // 720 - 75 - 100 = 545 pixels (full height minus header and hotkey region)
    lv_obj_set_style_bg_color(content, lv_color_make(0x00, 0x00, 0x00), LV_PART_MAIN); // Black background for dark mode
    lv_obj_set_style_border_width(content, 0, LV_PART_MAIN);
    lv_obj_align(content, LV_ALIGN_TOP_MID, 0, 75);  // Position below header
    
    // Store content area reference for menu navigation
    s_content_area = content;
    
    // Navigation system will handle UI creation
    // No need to create hotkey region or main menu manually
    LV_UNLOCK();

    ESP_LOGI(TAG, "Main UI created successfully");

    // Create meter update timer (every 33ms for 30 FPS real-time updates)
    const esp_timer_create_args_t meter_timer_args = {
        .callback = &meter_update_cb,
        .name = "meter_timer"
    };
    esp_err_t timer_ret = esp_timer_create(&meter_timer_args, &s_meter_timer_handle);
    if (timer_ret == ESP_OK) {
        esp_timer_start_periodic(s_meter_timer_handle, 33000); // 33ms in microseconds (30 FPS)
        ESP_LOGI(TAG, "Meter timer started (33ms real-time updates - 30 FPS)");
    } else {
        ESP_LOGE(TAG, "Failed to create meter timer: %s", esp_err_to_name(timer_ret));
    }

    // Register meter data callback for real-time audio meter updates
    inter_mcu_set_meter_listener(meter_data_cb, NULL);
    ESP_LOGI(TAG, "Meter data callback registered");
    
    // Test meter callback with dummy data to verify it's working
    ESP_LOGI(TAG, "Testing meter callback with dummy data...");
    meter_data_cb(0.5f, 0.8f, NULL); // Test with 50% RMS, 80% peak

    // Start TCA8418 keypad on BSP I2C; INT on GPIO31 per pin_config
    {
        const int tca_int_gpio = WAVEX_ESP_BTN_INT; // GPIO31
        const uint8_t tca_addr = 0x34;
        esp_err_t kret = wavex_ui::tca8418_keypad_start(tca_int_gpio, tca_addr);
        if (kret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to start TCA8418 keypad: %s", esp_err_to_name(kret));
        } else {
            ESP_LOGI(TAG, "TCA8418 keypad started (INT GPIO=%d, addr=0x%02X)", tca_int_gpio, tca_addr);
        }
    }

    // Initialize navigation system
    wavex_ui::initNavigationSystem();
    
    // Set navigation context as active input handler
    wavex_ui::InputDispatcher::instance().setActiveContext(wavex_ui::createNavigationContext());

    // Main UI loop with adaptive refresh rate control
    ESP_LOGI(TAG, "UI loop started with adaptive refresh rate control");
    while (1) {
        // Apply encoder movement to active UI when applicable
        int32_t enc_delta = pcnt_consume_delta(WAVEX_ENCODER_PCNT_UNIT);
        if (enc_delta != 0) {
            // Post unified input events for encoder movement
            wavex_ui::InputEvent evt;
            evt.type = (enc_delta > 0) ? wavex_ui::InputType::EncoderRight : wavex_ui::InputType::EncoderLeft;
            evt.delta = (int16_t)enc_delta;
            evt.timestamp_ms = (uint32_t)(esp_timer_get_time() / 1000);
            wavex_ui::InputDispatcher::instance().post(evt);

            // Navigation system handles all encoder input through InputDispatcher
            // No need for manual encoder handling here
        }
        // Dispatch queued input events to current context
        wavex_ui::InputDispatcher::instance().processAll();
        
        // Process deferred diagnostics updates (prevents deadlock)
        diagnostics_page_process_deferred_updates();
        
