pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
        // Process deferred meter updates (prevents deadlock during audio playback)
        process_deferred_meter_updates();
        // // If deferred update still pending (LVGL timers or lock contention), ensure it is applied here
        // if (s_meter_update_pending || s_meter_reset_pending) {
        //     LV_LOCK();
        //     ESP_LOGI(TAG, "UI_LOOP: forcing LVGL meter apply (pending=%d reset=%d)", s_meter_update_pending ? 1 : 0, s_meter_reset_pending ? 1 : 0);
        //     lvgl_meter_apply_cb(NULL);
        //     LV_UNLOCK();
        // }
        
        // Process deferred file browser updates (prevents deadlock from SPI task)
        if (g_sample_load_save_page) {
            wavex_sample_load_save_update(g_sample_load_save_page);
        }
        
        // Use adaptive refresh control for optimal performance
        adaptive_refresh_control();
        
        // Short delay to prevent excessive CPU usage
        vTaskDelay(pdMS_TO_TICKS(32)); // 32ms delay for 30 FPS theoretical maximum
    }
 }
 
 esp_err_t wavex_ui_task_start(void)
 {
     ESP_LOGI(TAG, "Starting UI task with MIPI DSI display and LVGL...");
     
    // Create UI task on Core 1 (different from SPI which typically runs on Core 0)
    BaseType_t task_ret = xTaskCreatePinnedToCore(
        ui_task,
        "ui_task",
        16384,  // Increased stack size to 16KB for LVGL and diagnostics
        NULL,
        2,     // Priority
        &s_ui_task_handle,
        1      // Run on Core 1
    );
     
     if (task_ret != pdPASS) {
         ESP_LOGE(TAG, "Failed to create UI task");
         return ESP_FAIL;
     }
     
     ESP_LOGI(TAG, "UI task started successfully");
     return ESP_OK;
 }
 
 esp_err_t wavex_ui_task_stop(void)
 {
     ESP_LOGI(TAG, "Stopping UI task...");
     
     if (s_ui_task_handle != NULL) {
         vTaskDelete(s_ui_task_handle);
         s_ui_task_handle = NULL;
     }

    // Stop and delete the LVGL tick timer
    if (s_lvgl_tick_timer_handle) {
        esp_timer_stop(s_lvgl_tick_timer_handle);
        esp_timer_delete(s_lvgl_tick_timer_handle);
        s_lvgl_tick_timer_handle = NULL;
    }

    // Stop diagnostics page module
    diagnostics_page_stop();

    // Stop and delete the meter timer
    if (s_meter_timer_handle) {
        esp_timer_stop(s_meter_timer_handle);
        esp_timer_delete(s_meter_timer_handle);
        s_meter_timer_handle = NULL;
    }
     
     // Deinitialize LVGL
     if (s_lvgl_display) {
         lv_display_delete(s_lvgl_display);
         s_lvgl_display = NULL;
     }
     
     // Deinitialize touch controller (BSP will handle this)
     if (s_touch_handle) {
         esp_lcd_touch_del(s_touch_handle);
         s_touch_handle = NULL;
     }

     // BSP handles I2C bus cleanup automatically
     
     // Deinitialize display using BSP
     // BSP handles display cleanup automatically when LVGL display is deleted
     // No need for manual panel deinitialization
     
     ESP_LOGI(TAG, "UI task stopped");
     return ESP_OK;
 }
 
esp_err_t wavex_ui_get_panel_handle(esp_lcd_panel_handle_t *panel_handle)
{
    if (panel_handle == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    // Get panel handle from BSP if not already available
    if (s_panel_handle == NULL) {
        ESP_LOGI(TAG, "Getting panel handle from BSP...");
        bsp_display_config_t config = {0}; // Default config
        ESP_RETURN_ON_ERROR(bsp_display_new(&config, &s_panel_handle, NULL),
                           TAG, "Failed to get panel handle from BSP");
    }

    *panel_handle = s_panel_handle;
    return ESP_OK;
}

// All page pointers are now managed through the UI navigation system or globals
// wavex_sample_load_save_page_t* g_sample_load_save_page is defined in ui_globals.cpp

static lv_obj_t* s_status_bar_container;
static lv_obj_t* s_page_container;